## 결측치 처리

In [12]:
import pandas as pd 
data = pd.read_csv('Ex_Missing.csv', encoding='utf-8')

In [13]:
# 데이터에 포함되어 있는 결측치를 처리하기 위해 pandas의 isnull함수를 이용해야함 
# true와 false로 반환되며 결측치가 있으면 true로 반환 
pd.isnull(data)

   salary  sales    roe  industry
0   False  False  False     False
1    True  False  False     False
2    True  False  False     False
3   False  False  False     False
4   False   True  False     False
5   False   True  False     False
6   False  False  False     False
7   False  False  False     False
8   False  False  False     False
9   False  False   True     False

In [14]:
data.isnull()

   salary  sales    roe  industry
0   False  False  False     False
1    True  False  False     False
2    True  False  False     False
3   False  False  False     False
4   False   True  False     False
5   False   True  False     False
6   False  False  False     False
7   False  False  False     False
8   False  False  False     False
9   False  False   True     False

In [15]:
data.isnull().sum()
# 데이터의 변수 별 결측치의 개수를 확인

salary      2
sales       2
roe         1
industry    0
dtype: int64

In [16]:
data.isnull().sum(1)
# 행 단위로 결측값 개수 구할 수 있음 
# sum에 1을 넣으면 행별 결측치 개수

0    0
1    1
2    1
3    0
4    1
5    1
6    0
7    0
8    0
9    1
dtype: int64

In [17]:
data['MissinCount'] = data.isnull().sum(1)
data

   salary         sales        roe  industry  MissinCount
0  1095.0  27595.000000  14.100000         1            0
1     NaN   9958.000000  10.900000         1            1
2     NaN   6125.899902  23.500000         1            1
3   578.0  16246.000000   5.900000         1            0
4  1368.0           NaN  13.800000         1            1
5  1145.0           NaN  20.000000         2            1
6  1078.0   2266.699951  16.400000         2            0
7  1094.0   2966.800049  16.299999         2            0
8  1237.0   4570.200195  10.500000         2            0
9   833.0   2830.000000        NaN         2            1

### 결측값 제거

In [18]:
# 결측값을 처리하는 방법으로 dropna()함수가 존재

data_del_row = data.dropna(axis = 0)
data_del_row
# axis가 0이면 행을 기준으로 결측값이 존재하는 데이터를 삭제

   salary         sales        roe  industry  MissinCount
0  1095.0  27595.000000  14.100000         1            0
3   578.0  16246.000000   5.900000         1            0
6  1078.0   2266.699951  16.400000         2            0
7  1094.0   2966.800049  16.299999         2            0
8  1237.0   4570.200195  10.500000         2            0

In [19]:
data_del_col = data.dropna(axis=1)
data_del_col 
# axis가 1이면 열을 기준으로 결측값이 존재하는 데이터를 삭제

   industry  MissinCount
0         1            0
1         1            1
2         1            1
3         1            0
4         1            1
5         2            1
6         2            0
7         2            0
8         2            0
9         2            1

In [20]:
# 결측값이 있는 특정 행, 열 제거 
data[['salary']].dropna()

   salary
0  1095.0
3   578.0
4  1368.0
5  1145.0
6  1078.0
7  1094.0
8  1237.0
9   833.0

### 결측값 대체

In [21]:
import pandas as pd 
data = pd.read_csv('Ex_Missing.csv', encoding = "utf-8")

In [22]:
data_0 = data.fillna(0)
data_0
# fillna()를 활용하여 결측값인 데이터를 특정 값으로 바꿀 수 있음

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1     0.0   9958.000000  10.900000         1
2     0.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0      0.000000  13.800000         1
5  1145.0      0.000000  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000   0.000000         2

In [23]:
data_missing = data.fillna('missing')
data_missing
# 문자열로도 데이터의 결측치를 채울 수 있음

    salary        sales        roe  industry
0   1095.0      27595.0       14.1         1
1  missing       9958.0       10.9         1
2  missing  6125.899902       23.5         1
3    578.0      16246.0        5.9         1
4   1368.0      missing       13.8         1
5   1145.0      missing       20.0         2
6   1078.0  2266.699951       16.4         2
7   1094.0  2966.800049  16.299999         2
8   1237.0  4570.200195       10.5         2
9    833.0       2830.0    missing         2

In [27]:
data_ffill = data.fillna(method = "ffill")
print(data_ffill)
print()
data_pad = data.fillna(method="pad")
print(data_pad)
# 데이터의 결측치를 채울 수 있는 방법으로 method의 ffill이나 pad를 활용하여 앞 데이터의 값으로 채울 수 있음

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1095.0   9958.000000  10.900000         1
2  1095.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0  16246.000000  13.800000         1
5  1145.0  16246.000000  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  10.500000         2

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1095.0   9958.000000  10.900000         1
2  1095.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0  16246.000000  13.800000         1
5  1145.0  16246.000000  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  10.500000         2

In [28]:
data_bfill=data.fillna(method="bfill")
print(data_bfill)
print()

data_backfill = data.fillna(method="backfill")
print(data_backfill)
# bfill과 backfill을 활용하여 결측값을 데이터의 뒷 방향으로 채울 수 있음

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1   578.0   9958.000000  10.900000         1
2   578.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   2266.699951  13.800000         1
5  1145.0   2266.699951  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1   578.0   9958.000000  10.900000         1
2   578.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   2266.699951  13.800000         1
5  1145.0   2266.699951  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

In [29]:
# 평균 대체 
# 결측값을 평균으로 대체할 수 있음
data_mean = data.fillna(data.mean())
data_mean
# 각 변수의 평균값으로 평균을 대체할 수 있음

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1053.5   9958.000000  10.900000         1
2  1053.5   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   9069.825012  13.800000         1
5  1145.0   9069.825012  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  14.600000         2

In [30]:
data_median = data.fillna(data.median())
data_median
# 중앙값, 최소값, 최대값으로 데이터의 결측값을 대체할 수 있음

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1094.5   9958.000000  10.900000         1
2  1094.5   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   5348.050049  13.800000         1
5  1145.0   5348.050049  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  14.100000         2

In [31]:
data_other_mean = data.fillna(data.mean()['salary'])
data_other_mean
# 모든 데이터의 결측값을 특정 변수의 값으로도 대체할 수 있음

   salary         sales          roe  industry
0  1095.0  27595.000000    14.100000         1
1  1053.5   9958.000000    10.900000         1
2  1053.5   6125.899902    23.500000         1
3   578.0  16246.000000     5.900000         1
4  1368.0   1053.500000    13.800000         1
5  1145.0   1053.500000    20.000000         2
6  1078.0   2266.699951    16.400000         2
7  1094.0   2966.800049    16.299999         2
8  1237.0   4570.200195    10.500000         2
9   833.0   2830.000000  1053.500000         2

In [37]:
import numpy as np
data2 = data.copy()

data2['sales_new'] = np.where(pd.notnull(data2['sales']) == True, data2['sales'], data2['salary'])
data2
# sales의 결측값을 salary값으로 대체

   salary         sales        roe  industry     sales_new
0  1095.0  27595.000000  14.100000         1  27595.000000
1     NaN   9958.000000  10.900000         1   9958.000000
2     NaN   6125.899902  23.500000         1   6125.899902
3   578.0  16246.000000   5.900000         1  16246.000000
4  1368.0           NaN  13.800000         1   1368.000000
5  1145.0           NaN  20.000000         2   1145.000000
6  1078.0   2266.699951  16.400000         2   2266.699951
7  1094.0   2966.800049  16.299999         2   2966.800049
8  1237.0   4570.200195  10.500000         2   4570.200195
9   833.0   2830.000000        NaN         2   2830.000000

In [38]:
data.groupby('industry').mean()

               salary         sales    roe
industry
1         1013.666667  14981.224976  13.64
2         1077.400000   3158.425049  15.80

In [41]:
fill_mean_fun = lambda g: g.fillna(g.mean())

In [42]:
data_group_mean = data.groupby('industry').apply(fill_mean_fun)
data_group_mean

        salary         sales        roe  industry
0  1095.000000  27595.000000  14.100000         1
1  1013.666667   9958.000000  10.900000         1
2  1013.666667   6125.899902  23.500000         1
3   578.000000  16246.000000   5.900000         1
4  1368.000000  14981.224975  13.800000         1
5  1145.000000   3158.425049  20.000000         2
6  1078.000000   2266.699951  16.400000         2
7  1094.000000   2966.800049  16.299999         2
8  1237.000000   4570.200195  10.500000         2
9   833.000000   2830.000000  15.800000         2